<template>
  <div id="users">
    <mt-header flexd title="用户协议" class="tops">
      <mt-button icon="back" @click="backgo" slot="left"></mt-button>
    </mt-header>
    <div class="main">
      <p class="headers">巨柚商城用户协议</p>
      <p class="title">一、提示条款</p>
      <p class="center"> 巨柚商城提醒您：在使用巨柚商城平台各项服务前，请您务必仔细阅读并透彻理解本协议。如对本协议内容有任何疑问，您可向平台客服咨询。阅读本协议的过程中，如果您不同意本协议或其中任何内容，您应立即停止使用巨柚商城平台服务。如果您使用巨柚商城平台服务的，您的使用行为将被视为对本协议全部内容的认可。</p>
      <p class="center">巨柚商城平台网站有权在必要时修改服务条款，商城网站服务条款一旦发生变动，将在重要页面上提示修改内容。如果不同意所改动的内容，您应立即停止使用巨柚商城平台服务。如果您继续享用网络服务，则视为接受服务款的变动。</p>
      <p class="title">权利归属</p>
      <p class="center">除非巨柚商城另行协议，巨柚商城平台内的所有产品、技术、软件、程序、数据及其他信息（包括但不限于文字、图像、图片、照片、音频、视频、图表、色彩、版面设计、 电子文档）的所有权利（包括但不限于版权、商标权、专利权、商业秘密及其他所有相关权利）均归巨柚商城或其关联公司所有。未经巨柚商城许可，任何人不得擅自使用 。巨柚商城平台的Logo、“巨柚商城”等文字、图形及其组合，以及淘宝平台的其他标识、徵记、产品和服务名称均为巨柚商城及其关联公司在中国和其它国家的商标，未经巨柚商城书面授权，任何人不得以任何方式展示、使用或作其他处理，也不得向他人表明您有权展示、使用或作其他处理。</p>
<p class="title">责任限制</p>
      <p class="center">巨柚商城平台上的品牌、商品信息（包括但不限于品牌名称、公司名称、 联系人及联络信息、产品的描述和说明、相关图片、视频等）均由合作商户自行提供并上传，由合作商户对其提供并上传的所有信息承担相应法律责任。</p>
      <p class="center">巨柚商城平台并非商城上陈列的商品和服务的提供方或售卖方，该等商品和服务由合作商户向您提供，由其承担其商品和服务的质量保证责任。您应自行谨慎判断确定相关商品和服务的真实性、合法性和有效性，并自行承担因此产生的责任与损失。当您与合作商户关于交易发生争议并提交巨柚商城平台，巨柚商城平台会积极对争议进行调处，维护您的合法权益。</p>
      <p class="center">巨柚商城平台对不可抗力导致的损失不承担责任。本用户协议所指不可抗力包括：天灾、法律法规或政府指令的变更，因网络服务特性而特有的原因，例如境内外基础电信运营商的故障、计算机或互联网相关技术缺陷、互联网覆盖范围限制、计算机病毒、黑客攻击等因素，及其他合法范围内的不能预见、不能避免并不能克服的客观情况。</p>
      <p class="title">二、隐私政策</p>
      <p class="center">巨柚商城（下称“我们”）非常尊重用户个人信息的保护，在您使用巨柚商城平台提供的服务时，我们将按照本隐私权政策收集、使用及共享您的个人信息。本隐私权政策包含了我们收集、存储、使用、共享和保护您的个人信息的条款，我们希望通过本隐私权政策向您清晰地介绍我们对您个人信息的处理方式，因此我们建议您完整地阅读本隐私权政策，以帮助您了解维护自己隐私权的方式。如您对本隐私权政策有任何疑问，您可以通过平台客服与我们联系。如果您不同意本隐私权政策任何内容，您应立即停止使用巨柚商城服务。当您使用巨柚商城平台提供的任一服务时，即表示您已同意我们按照本隐私权政策来合法使用和保护您的个人信息。</p>
      <p class="title">适用范围</p>
      <p class="center">为用户提供更好、更优、更个性化的服务是巨柚商城坚持不懈的追求，也希望通过我们提供的服务可以更方便您的购物生活。本隐私权政策适用于巨柚商城平台提供的所有服务，您访问巨柚商城平台网站或登陆相关用户端使用巨柚商城平台提供的服务，均适用本隐私权政策。</p>
      <p class="center">需要特别说明的是，本隐私权政策不适用于其他第三方向您提供的服务，合作商家依托巨柚商城平台向您提供服务时，您向商家提供的个人信息不适用于本隐私权政策。</p>
      <p class="title">我们如何收集信息</p>
      <p class="center">我们收集信息是为了向您提供更好、更优、更个性化的服务，我们收集信息的方式如下：</p>
      <p class="center">1.您向我们提供的信息。 当您注册巨柚商城账户及您在使用巨柚商城平台提供的相关服务时填写及/或提交的信息，包括您的姓名、性别、出生年月日、电话号码、电子邮箱、地址及相关附加信息（如您所在的省份和城市、邮政编码等）。</p>
      <p class="center">2.在您使用服务过程中收集的信息。 为了提供并优化您需要的服务，我们会收集您使用服务的相关信息，这类信息包括：在您使用巨柚商城平台服务，或访问巨柚商城平台网页时，巨柚商城自动接收并记录的您的浏览器和计算机上的信息，包括但不限于您的IP地址、浏览器的类型、使用的语言、 访问日期和时间、软硬件特征信息及您需求的网页记录等数据；如您下载或使用巨柚商城或其关联公司用户端软件，或访问移动网页使用巨柚商城平台服务时，巨柚商城可能会读 取与您位置和移动设备相关的信息，包括但不限于设备型号、设备识别码、操作系统、分辨率、电信运营商等。</p>
      <p class="center">除上述信息外，我们还可能为了提供服务及改进服务质量的合理需要而收集您的其他信息，包括您与我们的用户服务团队联系时您提供的相关信息，您参与问卷调查时向我们发送的问卷答复信息。</p>
      <p class="center">3.来自第三方的信息</p>
      <p class="center">为了给您提供更好、更优、更加个性化的服务，或共同为您提供服务，或为了预防互联网欺诈的目的，巨柚商城的关联方、合作伙伴会依据法律的规定或与您的约定或征得您同意的前提下，向巨柚商城分享您的个人信息。</p>
      <p class="center">您了解并同意，以下信息不适用本隐私权政策：</p>
      <p class="center">a）信用评价、违反法律规定或违反巨柚商城规则行为及巨柚商城已对您采取的措施；</p>
      <p class="center">b) 应法律法规要求需公示的企业名称等相关工商注册信息以及自然人经营者的信息。</p>
      <p class="title">我们如何使用信息 </p>
      <p class="center">因收集您的信息是为了向您提供服务及提升服务质量的目的，为了实现这一目的，我们会把您的信息用于下列用途：</p>
      <p class="center">1.向您提供您使用的各项服务，并维护、改进这些服务。</p>
      <p class="center"> 2.向您推荐您可能感兴趣的内容，包括但不限于向您发出产品和服务信息，或通过系统向您展示个性化的第三方推广信息，或者在征得您同意的情况下与巨柚商城的合作伙伴共享信息以便他们向您发送有关其产品和服务的信息。如您不希望接收上述信息，可通过相应的退订功能进行退订。</p>
      <p class="center">3.我们可能使用您的个人信息以预防、发现、调查欺诈、危害安全、非法或违反与我们或其关联方协议、政策或规则的行为，以保护您、其他我们用户，或我们或其关联方的合法权益。</p>
      <p class="center">4.我们可能会将来自某项服务的个人信息与来自其他服务的信息结合起来，用于为了给您提供更加个性化的服务使用。</p>
      <p class="center">5.经您许可的其他用途。</p>
      <p class="title">我们如何共享信息</p>
      <p class="center"> 我们对您的信息承担保密义务，不会为满足第三方的营销目的而向其出售或出租您的任何信息，我们会在下列情况下才将您的信息与第三方共享：</p>
      <p class="center">1.事先获得您的同意或授权。</p>
      <p class="center">2.根据法律法规的规定或行政或司法机构的要求。</p>
      <p class="center">3.如您是适格的知识产权投诉人并已提起投诉，应被投诉人要求，向被投诉人披露，以便双方处理可能的权利纠纷。</p>
      <p class="center">4.如您出现违反中国有关法律、法规或者巨柚商城相关协议或相关规则的情况，需要向第三方披露。</p>
      <p class="center">5.为维护巨柚商城及其关联方或用户的合法权益。</p>
      <p class="title">Cookie 和网络 Beacon 的使用 </p>
      <p class="center">为使您获得更轻松的访问体验，您访问巨柚商城平台相关网站或使用巨柚商城平台提供的服务时，我们可能会通过小型数据文件识别您的身份，这么做是帮您省去重复输入注册信息的步骤，或者帮助判断您的账户安全。这些数据文件可能是Cookie，Flash Cookie，或您的浏览器或关联应用程序提供的其他本地存储（统称“Cookie”）。</p>
      <p class="center">请您理解，我们的某些服务只能通过使用“Cookie”才可得到实现。如果您的浏览器或浏览器附加服务允许，您可以修改对Cookie的接受程度或者拒绝巨柚商城的Cookie，但这一举动在某些情况下可能会影响您安全访问巨柚商城平台相关网站和使用巨柚商城平台提供的服务。</p>
      <p class="title">信息存储</p>
      <p class="center">巨柚商城收集的有关您的信息和资料将保存在巨柚商城及（或）其关联公司的服务器上，这些信息和资料可能传送至您所在国家、地区或巨柚商城收集信息和资料所在地并在该地被访问、存储和展示。</p>
      <p class="title">您的个人信息保护</p>
      <p class="center">为保障您的信息安全，我们努力采取各种合理的物理、电子和管理方面的安全措施来保护您的信息，使您的信息不会被泄漏、毁损或者丢失，包括但不限于SSL、 信息加密存储、数据中心的访问控制。我们对可能接触到您的信息的员工或外包人员也采取了严格管理，包括但不限于根据岗位的不同采取不同的权限控制，与他们签署保密协议，监控他们的操作情况等措施。巨柚商城会按现有技术提供相应的安全措施来保护您的信息，提供合理的安全保障，巨柚商城将尽力做到使您的信息不被泄漏、 毁损或丢失。</p>
      <p class="center">您的账户均有安全保护功能，请妥善保管您的账户及密码信息。巨柚商城将通过向其它服务器备份、对用户密码进行加密等安全措施确保您的信息不丢失，不被滥用和变造。</p>
      <p class="center">在使用巨柚商城平台服务进行网上交易时，您不可避免的要向交易对方或潜在的交易对方披露自己的个人信息，如联络方式或者邮政地址。请您妥善保护自己的个人信息，仅在必要的情形下向他人提供。如您发现自己的个人信息泄密，尤其是您的账户及密码发生泄露，请您立即联络巨柚商城客服，以便巨柚商城采取相应措施。</p>
      <p class="title">三、用户依法言行义务</p>
      <p class="center">本协议依据国家相关法律法规规章制定，用户同意严格遵守以下义务：</p>
      <p class="center">（1）不得传输或发表：煽动抗拒、破坏宪法和法律、行政法规实施的言论，煽动颠覆国家政权，推翻社会主义制度的言论，煽动分裂国家、破坏国家统一的的言论，煽动民族仇恨、民族歧视、破坏民族团结的言论；</p>
      <p class="center">（2）从中国大陆向境外传输资料信息时必须符合中国有关法规；</p>
      <p class="center">（3）不得利用巨柚商城从事洗钱、窃取商业秘密、窃取个人信息等违法犯罪活动；</p>
      <p class="center">（4）不得干扰巨柚商城的正常运转，不得侵入巨柚商城及国家计算机信息系统；</p>
      <p class="center">（5）不得传输或发表任何违法犯罪的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、伤害性的、庸俗的，淫秽的、不文明的等信息资料；</p>
      <p class="center">（6）不得传输或发表损害国家社会公共利益和涉及国家安全的信息资料或言论；</p>
      <p class="center">（7）不得教唆他人从事本条所禁止的行为；</p>
      <p class="center">用户应不时关注并遵守巨柚商城不时公布或修改的各类合法规则规定。巨柚商城保有删除站内各类不符合法律政策或不真实的信息内容而无须通知用户的权利。 若用户未遵守以上规定的，巨柚商城有权作出独立判断并采取暂停或关闭用户帐号等措施。用户须对自己在网上的言论和行为承担法律责任。</p>
      <p class="title">四、商品信息</p>
      <p class="center"> 本站上的商品价格、数量、是否有货等商品信息随时都有可能发生变动，巨柚商城不作特别通知。由于商城上商品信息的数量极其庞大，虽然巨柚商城会尽最大努力保证您所浏览商品信息的准确性，但由于众所周知的互联网技术因素等客观原因存在，商城显示的信息可能会有一定的滞后性或差错，对此情形您知悉并理解；巨柚商城欢迎纠错，并会视情况给予纠错者一定的奖励。为表述便利，商品和服务简称为"商品"或"货物"。</p>
      <p class="title">五、订单</p>
      <p class="center">在您下订单时，请您仔细确认所购商品的名称、价格、数量、型号、规格、尺寸、联系地址、电话、收货人等信息。收货人与用户本人不一致的，收货人的行为和意思表示视为用户的行为和意思表示，用户应对收货人的行为及意思表示的法律后果承担连带责任。</p>
      <p class="center">除法律另有强制性规定外，双方约定如下：巨柚商城上销售方展示的商品和价格等信息仅仅是交易信息的发布，您下单时须填写您希望购买的商品数量、价款及支付方式、收货人、联系方式、收货地址等内容；系统生成的订单信息是计算机信息系统根据您填写的内容自动生成的数据，仅是您向销售方发出的交易诉求；销售方收到您的订单信息后，只有在销售方将您在订单中订购的商品从仓库实际直接向您发出时，方视为您与销售方之间就实际直接向您发出的商品建立了交易关系；如果您在一份订单里订购了多种商品并且销售方只给您发出了部分商品时，您与销售方之间仅就实际直接向您发出的商品建立了交易关系；只有在销售方实际直接向您发出了订单中订购的其他商品时，您和销售方之间就订单中该其他已实际直接向您发出的商品才成立交易关系。您可以随时登录您在巨柚商城注册的账户，查询您的订单状态。</p>
      <p class="center"> 由于市场变化及各种以合理商业努力难以控制的因素的影响，本站无法保证您提交的订单信息中希望购买的商品都会有货；如您拟购买的商品，发生缺货，您有权取消订单。</p>
      <p class="title">六、 配送</p>
      <p class="center">合作商户将会把商品（货物）送到您所指定的收货地址，所有在本站上列出的送货时间为参考时间，参考时间的计算是根据库存状况、正常的处理过程和送货时间、送货地点的基础上估计得出的。</p>
      <p class="center">因如下情况造成订单延迟或无法配送等，合作商户不承担延迟配送的责任：</p>
      <p class="center">（1）用户提供的信息错误、地址不详细等原因导致的；</p>
      <p class="center">（2）货物送达后无人签收，导致无法配送或延迟配送的；</p>
      <p class="center">（3）情势变更因素导致的；</p>
      <p class="center">（4）不可抗力因素导致的，例如：信息网络设备维护、信息网络连接故障、智能终端、通讯或其他系统的故障、电力故障、罢工、劳动争议、暴乱、起义、骚乱、火灾、洪水、风暴、爆炸、战争、政府行为、司法行政机关的命令、其他不可抗力或第三方的不作为而造成的不能服务或延迟服务不承担责任。无论在任何情况下（包括但不限于疏忽原因），由于使用巨柚商城上的信息或由巨柚商城软件链接的信息，或其他与巨柚商城软件链接的网站信息，对您或他人所造成任何的损失或损害（包括直接、间接、特别或后果性的损失或损害，例如收入或利润之损失，智能终端系统之损坏或数据丢失等后果），均由使用者自行承担责任（包括但不限于疏忽责任）。</p>
      <p class="title">七、未成年人保护</p>
      <p class="center">我们重视未成年人的保护。如果您在18周岁以下，您只能在父母或监护人的监护参与下才能使用本站。</p>
      <p class="title">八、争议的解决 </p>
      <p class="center"> 因本协议产生的争议或与本协议相关争议，巨柚商城平台与用户可协商解决。如协商不成或不愿意协商，任何一方均可提请巨柚商城平台公司注册地所在地人民法院裁决。</p>
      <p class="bottom">巨柚商城 <br>2018年3月</p>
    </div>

  </div>
</template>

<script>
  export default {
    name: "users",
    data() {
      return {}
    },
    mounted() {

    },
    methods: {
      backgo() {
        this.$router.go(-1)
      }
    }
  }
</script>

<style scoped lang="scss">
  #users {
    width: 100%;
    background: white;
    .tops {
      position: fixed;
      top: 0;
      left: 0;
      right: 0;
      background: white;
      padding: 10px;
      color: black;
      font-size: .5rem;
      z-index: 1000;
    }
    .main {
      padding: .2rem;
      margin-top: 1rem;
      .headers {
        text-align: center;
        font-size: .4rem;
        font-weight: bolder;
      }
      .title {
        font-size: .35rem;
        font-weight: bolder;
        text-align: left;
        margin-top: .3rem;
        margin-bottom: .3rem;
      }
      .center{
        line-height: 1.4;
        text-indent: 2em;
      }
      .bottom{
        text-align: right;
        margin-top: .5rem;
      }
    }

  }
</style>
