<template>
	<div id="procotol">
		<mt-header title='店长协议' class='center' style="font-weight: 500;">
			<router-link slot="left" to="/shop_manager">
				<mt-button icon="back"></mt-button>
			</router-link>
		</mt-header>
		<div class="main">
			<p>
				<i>名词解释：</i>
				店长：指通过巨柚商城购买指定礼包或者满足充值消费条件而具有推广能力的会员账号。 <br />
				红积分：指店长自己购买或者推荐客户购买而获得的积分奖励，红积分可以在交易完成之后申请等额提现。 <br />
				黄积分：指店长自己购买或者推荐客户购买而获得的积分奖励，黄积分可以在巨柚商城开放黄积分提现时间内申请等额提现。  <br />
				店长二维码：指店长推荐客户使用的推广工具，店长的客户通过店长二维码关注巨柚商城二维码，即可绑定为店长客户。  <br />
				店长账户 
				1、店长应当使用巨柚商城认可的账号登录系统，并保证在注册账号时提供的注册资料是真实、准确且合法的。  <br /> 
				2、针对店长在推广服务系统中使用的登录账号，根据相关法律、法规规定以及推广服务的特殊性和重要性， <br />
				<i>店长同意：</i>  
				1）提交个人有效身份信息进行实名认证；   <br />
				2）提供真实、准确的手机号、微信号等联系信息与登录账号进行关联，并在前述联系方式有变动时及时进行更新。  <br />
				<i>店长模式说明 </i>
				店长登录或注册巨柚系统账号，根据系统操作指引，为巨柚商城合作方平台商品及/或服务销售业务提供营销服务，即将带有店长或店长客户推广商参数的商品及/或服务链接分享给消费者，引导消费者至巨柚商城合作方平台进行购物消费。  <br /> 
				<i>赚取积分说明  </i>
				1、就店长提供的推广服务，巨柚商城将支付一定的服务费（以红积分、黄积分表现），具体根据店长以及店长客户在巨柚平台上进行购物消费所产生的有效订单销售额按比例进行服务费结算，即按照实际销售额提成服务费方式进行结算，结算数据以推广服务系统记录为准。服务费结算规则及标准由巨柚商城另行公布，且巨柚商城有权根据行业及自身业务发展情况单方面调整服务费结算规则及标准并在系统上予以公布，自公布之日起适用新的服务费结算规则及标准，对此店长表示理解并予以同意。   <br />
				2、店长以及在店长客户在巨柚商城合作方平台每产生一笔有效订单，巨柚商城根据结算当时适用的服务费结算规则及标准计算店长的红积分和黄积分并在系统后台显示，店长可根据系统提示流程向巨柚商城申请提现，巨柚商城收到提现申请后进行审核，并在审核通过后3-5个工作日内将相应的款项支付至店长绑定且已实名认证的提现账户。店长如对结算费用有异议的，可在收到结算费用后1日内向巨柚商城提出，双方人工核对结算费用，经核算，巨柚商城实际支付金额小于店长应得服务费金额的，巨柚商城另行向店长支付差额；巨柚商城实际支付金额大于店长应得服务费金额的，巨柚商城从未结算服务费中扣除差额部分，如未结算金额不足以抵扣的，店长应在收到巨柚商城通知之日起5日内将差额部分退还至巨柚商城另行指定的收款账户；若经核算仍不能确认清楚的，结算费用以巨柚商城核算的为准。 <br />  
				3、店长知悉并确认，本协议项下的服务费一经提现，即视为巨柚商城已完全履行相应的服务费支付义务，店长无权就该笔服务费向巨柚商城主张任何权利。   <br />
				3、店长确认并同意，在此过程中产生的店长个人所得税由店长自行承担并由巨柚商城从结算服务费中代扣代缴。若巨柚商城在代扣代缴过程中发现任何问题，包括但不限于店长身份信息不真实、存在其他从巨柚商城处获取的服务收入而未如实申报等，巨柚商城有权选择在店长纠正或补正前暂停支付相关服务费。   <br />
				5、店长确认并同意，巨柚商城有权对店长提出的提现申请进行形式审核，如经审核发现提现申请不符合巨柚商城规定或存在任何可能影响账户安全的情形，巨柚商城有权拒绝店长的提现申请直至店长修改其提现申请并符合巨柚商城规定或可能影响账户安全的情形得以消除。前述条款并不代表巨柚商城对店长的提现申请负有审核义务，店长应自行承担基于其系统账号发起的提现申请而产生的所有责任。  
				4、店长理解并同意，系统可能会因故导致无法按时结算服务费，此种情况下，不视为巨柚商城违约，但巨柚商城应当及时排查并修复系统故障，以争取尽快向店长支付相关服务费。  <br />
				6、店长知悉并同意，任一有效订单在巨柚商城据此向店长支付相应服务费后发生退货退款的，巨柚商城将在下一次的结算费用中扣除相应款项，下一次结算费用不足以抵扣的，从之后的结算费用中继续扣除，直至全部扣回为止；如全部扣回之前，双方终止合作，则店长应在收到巨柚商城通知之日起5日内将尚未扣回部分款项退还至巨柚商城另行指定的收款账户。  <br /> 
				7、店长认可，如出现下述任一情形，所涉消费者将不视为店长的粉丝，且巨柚商城将不予支付店长服务费：   <br />
				1）由于消费者自身原因导致店长参数丢失后直接登陆巨柚商城网站产生的购买行为；   <br />
				2）由于不可抗力（包括但不限于服务器意外关机、网络意外中断、巨柚商城受到恶意攻击及磁盘意外损坏等）而导致销售数据丢失；   <br />
				3）店长采取任何措施故意或客观上会使得消费者对巨柚商城产生任何误解或迷惑的（例如， 店长试图影响巨柚商城网站任何功能或交易过程的搜索、定购、浏览等）；   <br />
				4）消费者订单为用于再度销售或任何商业用途的非自用性质； <br />  
				5）店长提供服务过程中弄虚作假，如进行虚假宣传、虚构交易订单等；  <br /> 
				6）通过下述方式访问巨柚商城合作方平台的消费者购买而产生的订单：通过经输入一个普通的互联网搜索查询词或关键词后从搜索结果（即是自然的、免费的或未付费的搜索结果） 所生成或显示的链接；  <br /> 
				7）店长对运营商DNS域名进行劫持，表现为： <br />  
				a） 消费者自行访问巨柚商城合作方平台，但店长强制消费者跳转到带有店长跟踪代码的巨柚商城合作方平台页面，或在巨柚商城合作方平台链接后增加店长跟踪代码；   <br />
				b） 将巨柚商城合作方平台网页地址中巨柚商城或任何他方的跟踪代码修改成店长自己的跟踪代码；  <br /> 
				8）其他消费者未通过店长引导到达巨柚商城合作方平台的情形，或店长存在违背诚实信用原则行为的情形。  <br /> 
				<i>巨柚商城权利和义务 </i>  
				1、巨柚商城保证巨柚商城是推广服务系统的合法经营者；   <br />
				2、巨柚商城保证其提供的数据的真实性和公正性；   <br />
				3、巨柚商城保证按照本协议的约定按时确认、结算、支付积分提现费用； <br />  
				4、 如巨柚商城出现下述任一情形，店长有权要求提前终止本协议而无需承担违约责任（但店长须提前 15日书面通知巨柚商城） <br />  
				1）巨柚商城的任何财物被法庭查封、扣押、冻结或强制执行，导致店长无法根据本协议的约定收取服务费的；   <br />
				2）巨柚商城申请解散、破产或清算(因重组或合并等正常的组织架构调整原因进行清算者 例外)。   <br />
				5、巨柚商城有权在通知店长后从结算款项中扣除店长根据本协议应向巨柚商城支付的任何债务（包括但不限于违约金）。 <br />  
				6、巨柚商城有权根据巨柚商城业务实际经营情况等调整或终止系统的运营，届时巨柚商城将提供相应的过渡或退出方案并在系统上进行公示，系统的具体运营调整时间或终止运营时间以该过渡或退出方案载明时间为准。 <br />  
				7、为使店长及时、全面了解系统和巨柚商城合作方平台相关的信息与动态，店长同意，巨柚商城可以多次、长期向店长发送与系统及巨柚商城合作方平台相关的各类商业性短信息而无需另行获得店长的同意。  <br />
				<i>店长权利和义务 </i>  
				1、店长承诺并保证其具备履行本合同项下服务所需的能力。为了服务的顺利、平稳进行，店长应尽最大努力保证服务方式的灵活性。   <br />
				2、店长保证登录巨柚商城的微信账号为店长自身所持有并已通过实名认证，且该实名认证信息与店长推广服务系统账号的实名认证信息完全一致，否则因此产生的一切责任均由店长自行承担。  <br /> 
				3、店长保证其为推广、宣传巨柚商城合作方平台产品而采取的推广、宣传方式及/或发布的信息内容符合有关法律法规的规定，并不侵犯巨柚商城及/或任何第三方的合法权益。如因店长推广、宣传方式及/或发布的信息内容违反相关法律法规规定，及/或侵犯巨柚商城及/或任何第三方的合法权益而产生的任何争议、纠纷、诉讼、仲裁、处罚、赔偿等，均由店长自行负责处理并承担所有相关法律责任，与巨柚商城无涉。   <br />
				4、店长承诺，在履行本协议过程中，以扩大宣传、推广巨柚商城及合作方平台其形象、产品和服务为本协议的根本目的，并保证在履行本协议项下约定时遵循诚实信用原则，不损害巨柚商城、合作方平台及巨柚商城关联公司的任何利益。  <br />
				<i>其他 </i> 
				双方在此声明：双方不会因根据本协议产生的合作，构成任何形式的劳动或雇佣关系。店长不隶属于巨柚商城，不受巨柚商城内部规章制度的约束。巨柚商城除向店长支付本协议约定的服务费外，不承担店长的任何其他费用，包括但不限于因推广活动所产生的成本、社会保险、福利和医疗保险费用等。  <br />
				本协议不包含任何可能理解为双方之间设立一种代理或合伙关系的内容。店长无权代表巨柚商城对外缔结合同。店长不得以巨柚商城的名义开展任何与约定的推广无关的活动或者从事违法犯罪活动，否则一切后果由店长自行承担，同时巨柚商城保留追究其法律责任的权利。 <br />
				 巨柚商城  <br />
				 2018年3月

			</p>
		</div>
		<div class="btn" @click="oks">
			<input type="button" value="我已阅读并同意协议" />
		</div>
	</div>
</template>

<script>
	import { Header } from 'mint-ui'
	export default {
		data() {
			return {

			}
		},
		methods: {
			oks() {
				sessionStorage.oks = 1
				this.$router.push("/shop_manager")
			},
		}
	}
</script>

<style lang="scss" scoped="scoped">
	#procotol {
		.center {
			background: #fff;
			color: black;
			height: auto;
			font-size: .5rem;
			padding: 10px;
			padding-top: 5px;
			padding-bottom: 5px;
		}
		.main {
			font-size: .35rem;
			padding:.3rem;
			height:14rem;
			overflow: hidden;
			p {
				height:14rem;
				line-height:2;
				overflow: scroll;
				color: rgb(51, 51, 51);
				i{
					font-weight: bolder;
					display: block;
				}
			}
		}
		.btn {
			margin-left: 10px;
			margin-right: 10px;
			border-radius: 5px;
			input {
				width: 100%;
				padding: 12px;
				font-size: .4rem;
				text-align: center;
				color: white;
				background: #ff403c;
				letter-spacing: 2px;
				border-radius: 5px;
			}
		}
	}
</style>